<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="思悟," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x5B66;&amp;#x4E60;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF0C;&amp;#x4E00;&amp;#x76F4;&amp;#x662F;&amp;#x5F71;&amp;#x54CD;&amp;#x4E2A;&amp;#x4EBA;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x74F6;&amp;#x9888;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#xFF0C;&amp;#x6211;&amp;#x89C9;&amp;#x5F97;&amp;#x6709;">
<meta property="og:type" content="article">
<meta property="og:title" content="反思学习方式——碎片式学习的陷阱">
<meta property="og:url" content="http://yoursite.com/2016/08/12/fragmentation-learning/index.html">
<meta property="og:site_name" content="映水青莲">
<meta property="og:description" content="&amp;#x5B66;&amp;#x4E60;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF0C;&amp;#x4E00;&amp;#x76F4;&amp;#x662F;&amp;#x5F71;&amp;#x54CD;&amp;#x4E2A;&amp;#x4EBA;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x74F6;&amp;#x9888;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#xFF0C;&amp;#x6211;&amp;#x89C9;&amp;#x5F97;&amp;#x6709;">
<meta property="og:updated_time" content="2016-08-12T13:57:58.201Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="反思学习方式——碎片式学习的陷阱">
<meta name="twitter:description" content="&amp;#x5B66;&amp;#x4E60;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF0C;&amp;#x4E00;&amp;#x76F4;&amp;#x662F;&amp;#x5F71;&amp;#x54CD;&amp;#x4E2A;&amp;#x4EBA;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x74F6;&amp;#x9888;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#xFF0C;&amp;#x6211;&amp;#x89C9;&amp;#x5F97;&amp;#x6709;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://yoursite.com/2016/08/12/fragmentation-learning/"/>

  <title> 反思学习方式——碎片式学习的陷阱 | 映水青莲 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">映水青莲</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">独立博客</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                反思学习方式——碎片式学习的陷阱
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-08-12T18:05:53+08:00" content="2016-08-12">
              2016-08-12
            </time>
          </span>

          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#xFF0C;&#x4E00;&#x76F4;&#x662F;&#x5F71;&#x54CD;&#x4E2A;&#x4EBA;&#x5B66;&#x4E60;&#x7684;&#x74F6;&#x9888;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6709;&#x5FC5;&#x8981;&#x597D;&#x597D;&#x53CD;&#x601D;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#x3002;</p>
<a id="more"></a>
<h1 id="&#x4F60;&#x662F;&#x5426;&#x7ECF;&#x5386;&#x8FC7;&#x2026;"><a href="#&#x4F60;&#x662F;&#x5426;&#x7ECF;&#x5386;&#x8FC7;&#x2026;" class="headerlink" title="&#x4F60;&#x662F;&#x5426;&#x7ECF;&#x5386;&#x8FC7;&#x2026;"></a>&#x4F60;&#x662F;&#x5426;&#x7ECF;&#x5386;&#x8FC7;&#x2026;</h1><p>&#x4F60;&#x6709;&#x6CA1;&#x6709;&#x542C;&#x8BF4;&#x8FC7;&#x4E00;&#x4E2A;&#x4ECE;&#x672A;&#x542C;&#x8FC7;&#x7684;&#x201C;&#x4E13;&#x4E1A;&#x540D;&#x8BCD;&#x201D;&#xFF0C;&#x56E0;&#x5BB3;&#x6015;&#x843D;&#x540E;&#x6216;&#x8DDF;&#x4E0D;&#x4E0A;&#x4E3B;&#x6D41;&#x800C;&#x7A81;&#x7136;&#x5F88;&#x60F3;&#x8981;&#x5B66;&#x4E60;&#xFF1F;</p>
<p>&#x4E8E;&#x662F;&#x4F60;&#x4E0A;&#x7F51;&#x767E;&#x5EA6;&#x6216;&#x8BA2;&#x9605;&#x522B;&#x4EBA;&#x63A8;&#x8350;&#x7684;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x50CF;&#x53D1;&#x73B0;&#x65B0;&#x5927;&#x9646;&#x4E00;&#x6837;&#xFF0C;&#x6C89;&#x6D78;&#x5728;&#x8D8A;&#x6765;&#x8D8A;&#x725B;&#x7684;&#x6587;&#x7AE0;&#x3001;&#x8D8A;&#x6765;&#x8D8A;&#x65B0;&#x9896;&#x7684;&#x6280;&#x672F;&#x91CC;&#xFF0C;&#x7136;&#x540E;&#x50CF;&#x6D77;&#x7EF5;&#x4E00;&#x6837;&#x5C3D;&#x5168;&#x529B;&#x5730;&#x53BB;&#x201C;&#x5438;&#x6536;&#x201D;&#x77E5;&#x8BC6;&#x3002;&#x4F60;&#x8BA2;&#x9605;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x6536;&#x85CF;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x53EF;&#x662F;&#x8FD8;&#x662F;&#x89C9;&#x5F97;&#x4E0D;&#x591F;&#x3002;&#x4F60;&#x4E0B;&#x8F7D;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x8D44;&#x6599;&#x3001;&#x6587;&#x6863;&#x5B58;&#x5728;&#x786C;&#x76D8;&#x91CC;&#xFF0C;&#x53EF;&#x662F;&#x8FD9;&#x91CC;&#x9762;&#x5F88;&#x591A;&#x4F60;&#x53EF;&#x80FD;&#x90FD;&#x6CA1;&#x6709;&#x770B;&#x8FC7;&#xFF0C;&#x4E5F;&#x8BB8;&#x518D;&#x4E5F;&#x4E0D;&#x4F1A;&#x770B;&#x4E86;&#x3002;</p>
<p>&#x6CA1;&#x8FC7;&#x591A;&#x4E45;&#xFF0C;&#x4F60;&#x5C31;&#x4E86;&#x89E3;&#x4E86;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x201C;&#x4E13;&#x4E1A;&#x540D;&#x8BCD;&#x201D;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x4E13;&#x4E1A;&#x540D;&#x8BCD;&#x201D;&#x7684;&#x642C;&#x8FD0;&#x5DE5;&#xFF0C;&#x90A3;&#x4E9B;&#x719F;&#x6089;&#x7684;&#x201C;&#x4E13;&#x4E1A;&#x540D;&#x8BCD;&#x201D;&#x4E8B;&#x5B9E;&#x4E0A;&#x4F60;&#x6839;&#x672C;&#x8BB2;&#x4E0D;&#x51FA;&#x6240;&#x4EE5;&#x7136;&#x6765;&#xFF0C;&#x4F60;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x90A3;&#x4E9B;&#x77E5;&#x8BC6;&#x50A8;&#x5907;&#x5C31;&#x50CF;&#x88AB;&#x6B8B;&#x7834;&#x7684;&#x6E14;&#x7F51;&#x7F51;&#x4F4F;&#x7684;&#x5B9D;&#x7BB1;&#xFF0C;&#x4E0D;&#x77E5;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x88AB;&#x6E4D;&#x6025;&#x7684;&#x6C34;&#x6D41;&#x5377;&#x8D70;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4F60;&#x653E;&#x5F03;&#x4E86;&#x4E0D;&#x65AD;&#x6536;&#x96C6;&#x77E5;&#x8BC6;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F60;&#x89C9;&#x5F97;&#x5F92;&#x52B3;&#x65E0;&#x529F;&#xFF0C;&#x5174;&#x8DA3;&#x7D22;&#x7136;&#xFF0C;&#x6700;&#x540E;&#x4F60;&#x89C9;&#x5F97;&#x8EAB;&#x4F53;&#x597D;&#x50CF;&#x88AB;&#x638F;&#x7A7A;&#x4E00;&#x6837;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x60F3;&#x52A8;&#x4E86;&#x3002;</p>
<p>&#x53EF;&#x6CA1;&#x8FC7;&#x591A;&#x4E45;&#xFF0C;&#x4F60;&#x53C8;&#x5F00;&#x59CB;&#x4E86;&#x4E0A;&#x9762;&#x7684;&#x5FAA;&#x73AF;&#xFF0C;&#x5B9B;&#x82E5;&#x547D;&#x8FD0;&#x4E00;&#x822C;&#xFF0C;&#x660E;&#x660E;&#x60F3;&#x9003;&#x5F00;&#xFF0C;&#x5374;&#x53C8;&#x56DE;&#x5230;&#x4E86;&#x6700;&#x521D;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4E5F;&#x6709;&#x8FC7;&#x4E0A;&#x8FF0;&#x7ECF;&#x5386;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x606D;&#x559C;&#x4F60;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5BF9;&#x4F60;&#x800C;&#x8A00;&#x5E76;&#x4E0D;&#x662F;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5E76;&#x6CA1;&#x6709;&#x4E0A;&#x8FF0;&#x7ECF;&#x5386;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x606D;&#x559C;&#x4F60;&#xFF0C;&#x4E0D;&#x7528;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x542C;&#x6211;&#x7ED9;&#x4F60;&#x8BB2;&#x6CA1;&#x6709;&#x7528;&#x7684;&#x3002;</p>
<h1 id="&#x8FD9;&#x90FD;&#x662F;&#x6211;&#x7684;&#x9519;&#x5417;&#xFF1F;"><a href="#&#x8FD9;&#x90FD;&#x662F;&#x6211;&#x7684;&#x9519;&#x5417;&#xFF1F;" class="headerlink" title="&#x8FD9;&#x90FD;&#x662F;&#x6211;&#x7684;&#x9519;&#x5417;&#xFF1F;"></a>&#x8FD9;&#x90FD;&#x662F;&#x6211;&#x7684;&#x9519;&#x5417;&#xFF1F;</h1><p>&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x7F79;&#x60A3;&#x201C;&#x7126;&#x8651;&#x75C7;&#x201D;&#x3001;&#x201C;&#x677E;&#x9F20;&#x75C7;&#x201D;&#x548C;&#x201C;&#x61D2;&#x764C;&#x201D;&#x8FD9;&#x4E09;&#x5927;&#x7EDD;&#x75C7;&#x662F;&#x6211;&#x7684;&#x9519;&#x5417;&#xFF1F;</p>
<p>&#x544A;&#x8BC9;&#x4F60;&#x4E00;&#x4EF6;&#x9AD8;&#x5174;&#x7684;&#x4E8B;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x4E0D;&#x4F60;&#x7684;&#x9519;&#x3002;&#x8981;&#x602A;&#xFF0C;&#x5C31;&#x602A;&#x8FD9;&#x4E2A;&#x4FE1;&#x606F;&#x5DE8;&#x91CF;&#x5316;&#x3001;&#x77E5;&#x8BC6;&#x788E;&#x7247;&#x5316;&#x7684;&#x65F6;&#x4EE3;&#x5427;&#x3002;</p>
<p>&#x4FE1;&#x606F;&#x7206;&#x70B8;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x66F4;&#x7B80;&#x5355;&#x4E0E;&#x5FEB;&#x6377;&#x7684;&#x9014;&#x5F84;&#xFF08;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#xFF09;&#x53BB;&#x83B7;&#x53D6;&#x6D77;&#x91CF;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x7684;&#x83B7;&#x53D6;&#x7684;&#x4FE1;&#x606F;&#x90FD;&#x662F;&#x788E;&#x7247;&#x5316;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;&#x6027;&#x3001;&#x7EC4;&#x7EC7;&#x6027;&#x662F;&#x6781;&#x5F31;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5F88;&#x96BE;&#x5C06;&#x788E;&#x7247;&#x5316;&#x7684;&#x4FE1;&#x606F;&#x7EC4;&#x7EC7;&#x6210;&#x4E00;&#x5B9A;&#x7684;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x5C31;&#x9677;&#x5165;&#x76F2;&#x76EE;&#x6536;&#x96C6;&#x77E5;&#x8BC6;&#x788E;&#x7247;&#xFF0C;&#x5374;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x7EC4;&#x7EC7;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x788E;&#x7247;&#x6765;&#x6784;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x3002;</p>
<p>{ %cq } &#x5373;&#x4F7F;&#x4F60;&#x62FF;&#x56DE;&#x6765;&#x4E00;&#x767E;&#x4E07;&#x4E2A;&#x77E5;&#x8BC6;&#x7684;&#x7802;&#x783E;&#xFF0C;&#x4E5F;&#x53EA;&#x662F;&#x6C99;&#x6F20;&#xFF0C;&#x4EBA;&#x4EEC;&#x7231;&#x770B;&#x7684;&#xFF0C;&#x662F;&#x6C99;&#x5B50;&#x805A;&#x5408;&#x6210;&#x7684;&#x91D1;&#x5B57;&#x5854;&#x3002; { %endcq }</p>
<h1 id="&#x4EC0;&#x4E48;&#x662F;-&#x6784;&#x5EFA;-&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF1F;"><a href="#&#x4EC0;&#x4E48;&#x662F;-&#x6784;&#x5EFA;-&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF1F;" class="headerlink" title="&#x4EC0;&#x4E48;&#x662F;(&#x6784;&#x5EFA;)&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF1F;"></a>&#x4EC0;&#x4E48;&#x662F;(&#x6784;&#x5EFA;)&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF1F;</h1><p>&#x6240;&#x8C13;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF0C;&#x662F;&#x77E5;&#x8BC6;&#x7684;&#x7EC4;&#x7EC7;&#x4E0E;&#x7BA1;&#x7406;&#xFF0C;&#x5C06;&#x81EA;&#x5DF1;&#x83B7;&#x53D6;&#x5E76;&#x52A0;&#x5DE5;&#x7684;&#x77E5;&#x8BC6;&#x5206;&#x95E8;&#x522B;&#x7C7B;&#x5730;&#x50A8;&#x5B58;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x786C;&#x76D8;&#x6216;&#x5927;&#x8111;&#x4E2D;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x5E94;&#x7528;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x63D0;&#x5230;&#x51E0;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x77E5;&#x8BC6;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x52A0;&#x5DE5;</li>
<li>&#x77E5;&#x8BC6;&#x9700;&#x8981;&#x5206;&#x7C7B;&#x7BA1;&#x7406;</li>
<li>&#x77E5;&#x8BC6;&#x9700;&#x8981;&#x88AB;&#x5E94;&#x7528;</li>
</ul>
<h1 id="&#x600E;&#x4E48;&#x6784;&#x5EFA;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF1F;"><a href="#&#x600E;&#x4E48;&#x6784;&#x5EFA;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF1F;" class="headerlink" title="&#x600E;&#x4E48;&#x6784;&#x5EFA;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF1F;"></a>&#x600E;&#x4E48;&#x6784;&#x5EFA;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF1F;</h1><h2 id="&#x660E;&#x786E;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x9700;&#x6C42;"><a href="#&#x660E;&#x786E;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x9700;&#x6C42;" class="headerlink" title="&#x660E;&#x786E;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x9700;&#x6C42;"></a>&#x660E;&#x786E;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x9700;&#x6C42;</h2><p>&#x77E5;&#x8BC6;&#x662F;&#x65E0;&#x7A77;&#x65E0;&#x5C3D;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x4E0D;&#x9700;&#x8981;&#x5305;&#x62EC;&#x6240;&#x6709;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5305;&#x62EC;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5FC5;&#x987B;&#x660E;&#x786E;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x7684;&#x77E5;&#x8BC6;&#x6709;&#x54EA;&#x4E9B;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x8FD8;&#x5FC5;&#x987B;&#x8BB0;&#x4F4F;&#x4E00;&#x70B9;&#xFF0C;&#x77E5;&#x8BC6;&#x662F;&#x4F1A;&#x66F4;&#x65B0;&#x7684;&#xFF0C;&#x77E5;&#x8BC6;&#x7684;&#x9700;&#x6C42;&#x4E5F;&#x662F;&#x4F1A;&#x66F4;&#x65B0;&#x7684;&#x3002;&#x4E0D;&#x518D;&#x88AB;&#x5E94;&#x7528;&#x7684;&#x77E5;&#x8BC6;&#x662F;&#x8FC7;&#x671F;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x8FC7;&#x671F;&#x7684;&#x77E5;&#x8BC6;&#x5C31;&#x8981;&#x53CA;&#x65F6;&#x6E05;&#x7406;&#x4E0E;&#x66F4;&#x65B0;&#x3002;</p>
<h2 id="&#x83B7;&#x53D6;&#x5E76;&#x52A0;&#x5DE5;&#x77E5;&#x8BC6;"><a href="#&#x83B7;&#x53D6;&#x5E76;&#x52A0;&#x5DE5;&#x77E5;&#x8BC6;" class="headerlink" title="&#x83B7;&#x53D6;&#x5E76;&#x52A0;&#x5DE5;&#x77E5;&#x8BC6;"></a>&#x83B7;&#x53D6;&#x5E76;&#x52A0;&#x5DE5;&#x77E5;&#x8BC6;</h2><p>&#x8981;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x53BB;&#x83B7;&#x53D6;&#x77E5;&#x8BC6;&#xFF0C;&#x907F;&#x514D;&#x4E0A;&#x6587;&#x63D0;&#x5230;&#x7684; <code>&#x77E5;&#x8BC6;&#x6536;&#x96C6;&#x7656;</code>&#x3002;</p>
<p>&#x83B7;&#x53D6;&#x77E5;&#x8BC6;&#x7684;&#x9014;&#x5F84;&#x6839;&#x636E;&#x4E2A;&#x4EBA;&#x4E60;&#x60EF;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x4E00;&#x822C;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x4EBA;&#x9645;&#x5173;&#x7CFB;</li>
<li>&#x641C;&#x7D22;&#x5F15;&#x64CE;</li>
<li>&#x4E66;&#x7C4D;</li>
<li>&#x4FE1;&#x606F;&#x805A;&#x5408;&#x5E73;&#x53F0;</li>
<li>&#x535A;&#x5BA2;</li>
<li>&#x6155;&#x8BFE;</li>
</ul>
<p>&#x83B7;&#x53D6;&#x7684;&#x77E5;&#x8BC6;&#x5F80;&#x5F80;&#x662F;&#x7C97;&#x7CD9;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x9002;&#x5E94;&#x4E2A;&#x4EBA;&#x7684;&#x7406;&#x89E3;&#x4E0E;&#x5229;&#x7528;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x539F;&#x751F;(<code>Raw</code>)&#x7684;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x52A0;&#x5DE5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; <code>&#x6DF1;&#x5165;&#x601D;&#x8003;</code>&#xFF0C;&#x7406;&#x89E3;&#x77E5;&#x8BC6;&#x5E76;&#x5C06;&#x5176;&#x8F6C;&#x5316;&#x6210;&#x53EF;&#x4EE5;&#x4E3A;&#x5DF1;&#x6240;&#x7528;&#x7684;&#x77E5;&#x8BC6;&#x3002;</p>
<h2 id="&#x8FD0;&#x7528;&#x77E5;&#x8BC6;"><a href="#&#x8FD0;&#x7528;&#x77E5;&#x8BC6;" class="headerlink" title="&#x8FD0;&#x7528;&#x77E5;&#x8BC6;"></a>&#x8FD0;&#x7528;&#x77E5;&#x8BC6;</h2><p>&#x6700;&#x5173;&#x952E;&#x7684;&#x4E00;&#x6B65;&#xFF0C;&#x5C31;&#x662F;&#x8FD0;&#x7528;&#x6240;&#x5B66;&#x7684;&#x77E5;&#x8BC6;&#x53BB;&#x89E3;&#x51B3;&#x5B9E;&#x9645;&#x7684;&#x95EE;&#x9898;&#x3002;&#x77E5;&#x8BC6;&#x5B66;&#x6765;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x663E;&#x6446;&#x6216;&#x6536;&#x85CF;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x4E3A;&#x4E86;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#x8FD0;&#x7528;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x8FD0;&#x7528;&#x77E5;&#x8BC6;&#xFF0C;&#x624D;&#x4F1A;&#x8BA9;&#x4F60;&#x4E86;&#x89E3;&#x77E5;&#x8BC6; &#x7CBE;&#x5999;&#x7684;&#x539F;&#x7406; &#x4E0E; &#x521B;&#x65B0;&#x7684;&#x7EC4;&#x5408;&#x65B9;&#x5F0F;&#x3002;</p>
<h2 id="&#x6574;&#x7406;&#x4E0E;&#x4FDD;&#x5B58;&#x77E5;&#x8BC6;"><a href="#&#x6574;&#x7406;&#x4E0E;&#x4FDD;&#x5B58;&#x77E5;&#x8BC6;" class="headerlink" title="&#x6574;&#x7406;&#x4E0E;&#x4FDD;&#x5B58;&#x77E5;&#x8BC6;"></a>&#x6574;&#x7406;&#x4E0E;&#x4FDD;&#x5B58;&#x77E5;&#x8BC6;</h2><p>&#x5728;&#x5F97;&#x5230;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#xFF0C; &#x5728;&#x8FD9;&#x91CC;&#x62D3;&#x5C55;&#x4E00;&#x4E2A;&#x4E13;&#x6709;&#x540D;&#x8BCD; <code>Personal Knowledge Management</code> (<code>&#x4E2A;&#x4EBA;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;</code>)&#xFF0C;&#x7B80;&#x79F0; <code>PKM</code>&#x3002;</p>
<p>&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x4F9D;&#x636E;&#x4E0D;&#x540C;&#x4EBA;&#x7684;&#x559C;&#x597D;&#x4E0E;&#x4E60;&#x60EF;&#x8FDB;&#x884C;&#x9009;&#x62E9;&#x5373;&#x53EF;&#x3002;</p>
<h2 id="&#x4EA4;&#x6D41;&#x4E0E;&#x5206;&#x4EAB;&#x77E5;&#x8BC6;"><a href="#&#x4EA4;&#x6D41;&#x4E0E;&#x5206;&#x4EAB;&#x77E5;&#x8BC6;" class="headerlink" title="&#x4EA4;&#x6D41;&#x4E0E;&#x5206;&#x4EAB;&#x77E5;&#x8BC6;"></a>&#x4EA4;&#x6D41;&#x4E0E;&#x5206;&#x4EAB;&#x77E5;&#x8BC6;</h2><p>&#x6D69;&#x701A;&#x7684;&#x77E5;&#x8BC6;&#x8981;&#x88AB;&#x4EBA;&#x6C38;&#x4E45;&#x8BB0;&#x5FC6;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#x4E8B;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x7684;&#x529E;&#x6CD5;&#x5F53;&#x7136;&#x4E0D;&#x662F;&#x6307;&#x6B7B;&#x8BB0;&#x786C;&#x80CC;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x4EA4;&#x6D41;&#x4E0E;&#x5206;&#x4EAB;&#x3002;</p>
<p>&#x4E0E;&#x4EBA;&#x4EA4;&#x6D41;&#x77E5;&#x8BC6;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5BF9;&#x77E5;&#x8BC6;&#x7684;&#x5370;&#x8C61;&#x4E0E;&#x7406;&#x89E3;&#x90FD;&#x4F1A;&#x968F;&#x7740;&#x6709;&#x6548;&#x7684;&#x4EA4;&#x6D41;&#x800C;&#x9010;&#x6E10;&#x52A0;&#x6DF1;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x66F4;&#x9AD8;&#x6548;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x5206;&#x4EAB;&#x77E5;&#x8BC6;&#xFF0C;&#x6240;&#x8C13;&#x5206;&#x4EAB;&#xFF0C;&#x4EA6;&#x53EF;&#x8BF4;&#x662F;&#x4F20;&#x6388;&#xFF0C;&#x662F;&#x81EA;&#x5DF1;&#x63D0;&#x70BC;&#x77E5;&#x8BC6;&#xFF0C;&#x5C06;&#x4E2A;&#x4EBA;&#x7406;&#x89E3;&#x4E0E;&#x4F53;&#x609F;&#x7B49;&#x9690;&#x6027;&#x77E5;&#x8BC6;&#x5177;&#x8C61;&#x5316;&#x8BED;&#x8A00;&#x3001;PPT&#x3001;&#x6587;&#x6863;&#x7B49;&#x663E;&#x6027;&#x77E5;&#x8BC6;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F60;&#x6559;&#x522B;&#x4EBA;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B66;&#x5230;&#x6700;&#x591A;&#x7684;&#x65E0;&#x7591;&#x8FD8;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#x3002;</p>
<h1 id="&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x8BB2;&#x4E86;&#x5565;&#xFF1F;"><a href="#&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x8BB2;&#x4E86;&#x5565;&#xFF1F;" class="headerlink" title="&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x8BB2;&#x4E86;&#x5565;&#xFF1F;"></a>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x8BB2;&#x4E86;&#x5565;&#xFF1F;</h1><h2 id="&#x8F93;&#x5165;"><a href="#&#x8F93;&#x5165;" class="headerlink" title="&#x8F93;&#x5165;"></a>&#x8F93;&#x5165;</h2><p>&#x77E5;&#x8BC6;&#x788E;&#x7247;&#x5316;&#x7684;&#x65F6;&#x4EE3;&#x91CC;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x8981;&#x4E86;&#x89E3;&#x81EA;&#x8EAB;&#x7684;&#x77E5;&#x8BC6;&#x9700;&#x6C42;&#xFF0C;&#x4E0D;&#x4F1A;&#x88AB;&#x4F60;&#x7528;&#x4E0A;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x90FD;&#x662F;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x6536;&#x96C6;&#x7684;&#x3002;&#x4E0D;&#x8981;&#x505A;&#x76F2;&#x76EE;&#x7684;&#x201C;&#x677E;&#x9F20;&#x201D;&#xFF0C;&#x6536;&#x96C6;&#x4E00;&#x5806;&#x7528;&#x4E0D;&#x4E0A;&#x7684;&#x201C;&#x677E;&#x679C;&#x201D;&#x3002;</p>
<h2 id="&#x683C;&#x5F0F;&#x5316;&#x8F93;&#x5165;"><a href="#&#x683C;&#x5F0F;&#x5316;&#x8F93;&#x5165;" class="headerlink" title="&#x683C;&#x5F0F;&#x5316;&#x8F93;&#x5165;"></a>&#x683C;&#x5F0F;&#x5316;&#x8F93;&#x5165;</h2><p>&#x83B7;&#x53D6;&#x7684;&#x77E5;&#x8BC6;&#x9700;&#x8981;&#x6DF1;&#x5165;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x6536;&#x85CF;&#x3002;</p>
<h2 id="&#x8F93;&#x51FA;"><a href="#&#x8F93;&#x51FA;" class="headerlink" title="&#x8F93;&#x51FA;"></a>&#x8F93;&#x51FA;</h2><p>&#x77E5;&#x8BC6;&#x9700;&#x8981;&#x8FD0;&#x7528;&#x4E8E;&#x5B9E;&#x9645;&#xFF0C;&#x5B9E;&#x9645;&#x8FD0;&#x7528;&#x624D;&#x662F;&#x77E5;&#x8BC6;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<h2 id="&#x683C;&#x5F0F;&#x5316;&#x8F93;&#x51FA;"><a href="#&#x683C;&#x5F0F;&#x5316;&#x8F93;&#x51FA;" class="headerlink" title="&#x683C;&#x5F0F;&#x5316;&#x8F93;&#x51FA;"></a>&#x683C;&#x5F0F;&#x5316;&#x8F93;&#x51FA;</h2><p>&#x77E5;&#x8BC6;&#x9700;&#x8981;&#x5206;&#x4EAB;&#x4E0E;&#x4EA4;&#x6D41;&#xFF0C;&#x52A0;&#x6DF1;&#x5BF9;&#x6574;&#x4E2A;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x7684;&#x628A;&#x63E1;&#x3002;</p>
<h2 id="&#x4FDD;&#x5B58;"><a href="#&#x4FDD;&#x5B58;" class="headerlink" title="&#x4FDD;&#x5B58;"></a>&#x4FDD;&#x5B58;</h2><p>&#x77E5;&#x8BC6;&#x9700;&#x8981;&#x6709;&#x7EC4;&#x7EC7;&#x7684;&#x7BA1;&#x7406;&#x65B9;&#x6CD5;&#xFF0C;&#x907F;&#x514D;&#x77E5;&#x8BC6;&#x7ED3;&#x6784;&#x6DF7;&#x4E71;&#x5316;&#xFF0C;&#x5EFA;&#x7ACB;&#x6E05;&#x6670;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/思悟/" rel="tag">#思悟</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/08/09/install-python/" rel="next" title="安装与配置 python2.x 和 python3.x">
                <i class="fa fa-chevron-left"></i> 安装与配置 python2.x 和 python3.x
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/08/24/japanese-tutorial/" rel="prev" title="日语五十音入门">
                日语五十音入门 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.png"
               alt="方觉浅" />
          <p class="site-author-name" itemprop="name">方觉浅</p>
          <p class="site-description motion-element" itemprop="description">一方净室，磨半生蹉跎</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">4</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              
                <span class="site-state-item-count">5</span>
                <span class="site-state-item-name">标签</span>
              
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#你是否经历过…"><span class="nav-number">1.</span> <span class="nav-text">你是否经历过…</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#这都是我的错吗？"><span class="nav-number">2.</span> <span class="nav-text">这都是我的错吗？</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#什么是-构建-知识体系？"><span class="nav-number">3.</span> <span class="nav-text">什么是(构建)知识体系？</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#怎么构建知识体系？"><span class="nav-number">4.</span> <span class="nav-text">怎么构建知识体系？</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#明确自己的知识需求"><span class="nav-number">4.1.</span> <span class="nav-text">明确自己的知识需求</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#获取并加工知识"><span class="nav-number">4.2.</span> <span class="nav-text">获取并加工知识</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#运用知识"><span class="nav-number">4.3.</span> <span class="nav-text">运用知识</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#整理与保存知识"><span class="nav-number">4.4.</span> <span class="nav-text">整理与保存知识</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#交流与分享知识"><span class="nav-number">4.5.</span> <span class="nav-text">交流与分享知识</span></a></li></ol></li><li class="nav-item nav-level-1"><a class="nav-link" href="#这篇文章讲了啥？"><span class="nav-number">5.</span> <span class="nav-text">这篇文章讲了啥？</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#输入"><span class="nav-number">5.1.</span> <span class="nav-text">输入</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#格式化输入"><span class="nav-number">5.2.</span> <span class="nav-text">格式化输入</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#输出"><span class="nav-number">5.3.</span> <span class="nav-text">输出</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#格式化输出"><span class="nav-number">5.4.</span> <span class="nav-text">格式化输出</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#保存"><span class="nav-number">5.5.</span> <span class="nav-text">保存</span></a></li></ol></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">方觉浅</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  




  
  

  

  

  

</body>
</html>
