<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="碎语," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x603B;&amp;#x5728;&amp;#x5FD9;&amp;#x7740;&amp;#x8D76;&amp;#x8DEF;&amp;#x548C;&amp;#x7EC6;&amp;#x8D4F;&amp;#x6CBF;&amp;#x9014;&amp;#x98CE;&amp;#x666F;&amp;#x7684;&amp;#x77DB;&amp;#x76FE;&amp;#x4E2D;&amp;#x8D25;&amp;#x4E0B;&amp;#x9635;&amp;#x6765;&amp;#xFF0C;&amp;#x6700;&amp;#x7EC8;&amp;#x5F97;">
<meta property="og:type" content="article">
<meta property="og:title" content="溯源还是出走">
<meta property="og:url" content="http://yoursite.com/2016/08/08/root/index.html">
<meta property="og:site_name" content="映水青莲">
<meta property="og:description" content="&amp;#x603B;&amp;#x5728;&amp;#x5FD9;&amp;#x7740;&amp;#x8D76;&amp;#x8DEF;&amp;#x548C;&amp;#x7EC6;&amp;#x8D4F;&amp;#x6CBF;&amp;#x9014;&amp;#x98CE;&amp;#x666F;&amp;#x7684;&amp;#x77DB;&amp;#x76FE;&amp;#x4E2D;&amp;#x8D25;&amp;#x4E0B;&amp;#x9635;&amp;#x6765;&amp;#xFF0C;&amp;#x6700;&amp;#x7EC8;&amp;#x5F97;">
<meta property="og:image" content="http://yoursite.com/2016/08/08/root/img01.jpg">
<meta property="og:updated_time" content="2016-08-08T15:14:07.022Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="溯源还是出走">
<meta name="twitter:description" content="&amp;#x603B;&amp;#x5728;&amp;#x5FD9;&amp;#x7740;&amp;#x8D76;&amp;#x8DEF;&amp;#x548C;&amp;#x7EC6;&amp;#x8D4F;&amp;#x6CBF;&amp;#x9014;&amp;#x98CE;&amp;#x666F;&amp;#x7684;&amp;#x77DB;&amp;#x76FE;&amp;#x4E2D;&amp;#x8D25;&amp;#x4E0B;&amp;#x9635;&amp;#x6765;&amp;#xFF0C;&amp;#x6700;&amp;#x7EC8;&amp;#x5F97;">
<meta name="twitter:image" content="http://yoursite.com/2016/08/08/root/img01.jpg">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://yoursite.com/2016/08/08/root/"/>

  <title> 溯源还是出走 | 映水青莲 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">映水青莲</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">独立博客</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                溯源还是出走
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-08-08T21:16:39+08:00" content="2016-08-08">
              2016-08-08
            </time>
          </span>

          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x603B;&#x5728;&#x5FD9;&#x7740;&#x8D76;&#x8DEF;&#x548C;&#x7EC6;&#x8D4F;&#x6CBF;&#x9014;&#x98CE;&#x666F;&#x7684;&#x77DB;&#x76FE;&#x4E2D;&#x8D25;&#x4E0B;&#x9635;&#x6765;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x65E0;&#x507F;&#x5931;&#x3002;<br><a id="more"></a></p>
<p>&#x6298;&#x817E;&#x4E86;&#x51E0;&#x5929;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x7B80;&#x5355;&#x5730;&#x5B9E;&#x73B0;&#x4E86;&#x5728;<strong><code>github</code></strong>&#x4E0A;&#x6784;&#x5EFA;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x535A;&#x5BA2;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x5927;&#x5F20;&#x65D7;&#x9F13;&#x5730;&#x5F00;&#x59CB;&#x7B79;&#x5907;&#x628A;&#x6574;&#x4E2A;&#x5EFA;&#x7AD9;&#x7684;&#x8FC7;&#x7A0B;&#x5199;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x7B2C;&#x4E00;&#x7BC7;&#x535A;&#x6587;&#x3002;&#x4E3A;&#x4E86;&#x4E0D;&#x8BA9;&#x7B2C;&#x4E00;&#x7BC7;&#x535A;&#x5BA2;&#x592A;&#x968F;&#x4FBF;&#xFF0C;&#x4E8E;&#x662F;&#x715E;&#x6709;&#x4ECB;&#x4E8B;&#x5730;&#x5206;&#x6790;&#x6574;&#x4E2A;&#x5EFA;&#x7AD9;&#x8FC7;&#x7A0B;&#xFF0C;&#x6253;&#x7B97;&#x8BE6;&#x5C3D;&#x63CF;&#x8FF0;&#x6BCF;&#x4E2A;&#x6B65;&#x9AA4;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x8BA9;&#x7B2C;&#x4E00;&#x7BC7;&#x535A;&#x5BA2;&#x4E0D;&#x592A;&#x6389;&#x4EFD;&#x3002;</p>
<p>&#x5206;&#x6790;&#x5B8C;&#x6D41;&#x7A0B;&#xFF0C;&#x5F00;&#x59CB;&#x63CF;&#x8FF0;&#x7B2C;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;&#x6CE8;&#x518C; github &#x8D26;&#x53F7;&#x3002;&#x4E3A;&#x4E86;&#x51F8;&#x663E;&#x5EFA;&#x7AD9;&#x7684;&#x4E3B;&#x8981;&#x6D41;&#x7A0B;&#xFF0C;&#x672C;&#x6765;&#x4E0D;&#x60F3;&#x591A;&#x82B1;&#x65F6;&#x95F4;&#x5728;&#x524D;&#x671F;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x4E0A;&#xFF0C;&#x4F46;&#x662F;&#x9003;&#x4E0D;&#x8FC7;&#x5FC3;&#x91CC;&#x7684;&#x90A3;&#x70B9;&#x5F3A;&#x8FEB;&#x75C7;&#xFF0C;&#x8FD8;&#x662F;&#x60F3;&#x627E;&#x4E00;&#x4E2A;&#x7B80;&#x6D01;&#x4F46;&#x5168;&#x9762;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x60F3;&#x5230;&#x4E86;&#x7528;&#x4E00;&#x4E2A; git &#x52A8;&#x6001;&#x56FE;&#x7247;&#x6765;&#x5C55;&#x793A;&#x6CE8;&#x518C;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x76EE;&#x524D;&#x624B;&#x5934;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x73B0;&#x6210;&#x7684; gif &#x5F55;&#x5236;&#x5DE5;&#x5177;&#xFF0C;&#x4E8E;&#x662F;&#x6253;&#x5F00;&#x4E86;&#x767E;&#x5EA6;&#xFF0C;&#x5F00;&#x59CB;&#x641C;&#x7D22;&#x3002;</p>
<p>&#x51E0;&#x5341;&#x5206;&#x949F;&#x540E;&#xFF0C;&#x6211;&#x5B89;&#x88C5;&#x597D;&#x4E86; <a href="http://www.cockos.com/licecap/" target="_blank" rel="external">LICEcap</a> &#x5DE5;&#x5177;&#xFF0C;&#x6253;&#x7B97;&#x5F00;&#x59CB;&#x5F55;&#x5236;&#x6CE8;&#x518C;&#x8FC7;&#x7A0B;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#x5F97;&#x518D;&#x627E;&#x4E00;&#x4E2A;&#x90AE;&#x7BB1;&#xFF0C;&#x4E8E;&#x662F;&#x627E;&#x4E86;&#x4E2A;QQ&#x5C0F;&#x53F7;(&#x25CF;&#x2019;&#x25E1;&#x2019;&#x25CF;)&#x3002;&#x597D;&#xFF0C;&#x6B63;&#x5F0F;&#x5F00;&#x59CB;&#x5F55;&#x5236;&#x4E86;&#xFF0C;&#x5728;&#x5F55;&#x5236;&#x5B8C;&#x7B2C;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x4E4B;&#x540E;&#xFF0C;&#x7531;&#x4E8E;&#x5BF9;&#x65B0;&#x5B89;&#x88C5;&#x7684; LICEcap &#x5DE5;&#x5177;&#x4E0D;&#x591F;&#x4E86;&#x89E3;&#xFF08;&#x5176;&#x5B9E;&#x4E5F;&#x6CA1;&#x5565;&#x529F;&#x80FD;&#xFF09;&#xFF0C;&#x5BF9;&#x5F55;&#x5236;&#x7ED3;&#x679C;&#x4E0D;&#x6EE1;&#x610F;&#xFF0C;&#x672C;&#x60F3;&#x7740;&#x91CD;&#x65B0;&#x5F55;&#x5236;&#x7684;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x6CE8;&#x518C;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86;&#x3002;</p>
<p>&#x60F3;&#x60F3;&#xFF0C;&#x89C9;&#x5F97;&#x521D;&#x671F;&#x51C6;&#x5907;&#x4E0D;&#x591F;&#xFF0C;&#x4E5F;&#x4E0D;&#x6EE1;&#x610F; LICEcap &#x7684;&#x5F55;&#x5236;&#x529F;&#x80FD;&#xFF0C;&#x5C31;&#x53C8;&#x4E0A;&#x767E;&#x5EA6;&#x627E;&#x4E86;&#x6B3E;&#x529F;&#x80FD;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x5F00;&#x6E90;&#x5DE5;&#x5177; <a href="http://screentogif.codeplex.com/" target="_blank" rel="external">ScreenToGif</a>&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x96F6;&#x96F6;&#x603B;&#x603B;&#x5730;&#x6298;&#x817E;&#x4E0B;&#x6765;&#xFF0C;&#x603B;&#x662F;&#x5F55;&#x597D;&#x4E00;&#x4E2A;&#x6837;&#x56FE;&#xFF0C;&#x53EF;&#x6253;&#x7B97;&#x5728;&#x535A;&#x6587;&#x91CC;&#x5F15;&#x7528;&#x56FE;&#x7247;&#x65F6;&#xFF0C;&#x53C8;&#x53D1;&#x73B0;&#x4E00;&#x5806;&#x95EE;&#x9898;&#xFF0C;&#x4E8E;&#x662F;&#x53C8;&#x662F;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x7684;&#x767E;&#x5EA6;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x65F6;&#x95F4;&#x8FC7;&#x53BB;&#x5730;&#x5F88;&#x5FEB;&#xFF0C;&#x95EE;&#x9898;&#x4E5F;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#xFF0C;&#x5F80;&#x5F80;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x800C;&#x6D6A;&#x8D39;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x5728;&#x641C;&#x7D22;&#x7B54;&#x6848;&#x4E0A;&#xFF0C;&#x66F4;&#x4E25;&#x91CD;&#x7684;&#x662F;&#x81EA;&#x5DF1;&#x8DDF;&#x6700;&#x521D;&#x7684;&#x76EE;&#x7684;&#x80CC;&#x9053;&#x76F8;&#x9A70;&#x3002;</p>
<p>&#x4E00;&#x5F00;&#x59CB;&#x840C;&#x751F;&#x60F3;&#x5199;&#x535A;&#x5BA2;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x53EA;&#x662F;&#x5355;&#x7EAF;&#x51FA;&#x4E8E;&#x60F3;&#x953B;&#x70BC;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x9010;&#x6E10;&#x9000;&#x5316;&#x7684;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x4E0D;&#x60A6;&#x4E8E;&#x5E73;&#x53F0;&#x535A;&#x5BA2;&#x7684;&#x4E0D;&#x53EF;&#x5B9A;&#x5236;&#x4E0E;&#x754C;&#x9762;&#x7684;&#x4E0D;&#x53CB;&#x597D;&#xFF0C;&#x624D;&#x6253;&#x7B97;&#x5EFA;&#x7ACB;&#x4E2A;&#x4EBA;&#x535A;&#x5BA2;&#xFF0C;&#x5374;&#x4E5F;&#x7740;&#x5B9E;&#x82B1;&#x4E86;&#x65F6;&#x95F4;&#x53BB;&#x4E86;&#x89E3;&#x4E0E;&#x6BD4;&#x8F83;&#x4E2A;&#x4EBA;&#x535A;&#x5BA2;&#x7684;&#x5EFA;&#x7ACB;&#x65B9;&#x5F0F;&#x3002;&#x65AD;&#x65AD;&#x7EED;&#x7EED;&#x6298;&#x817E;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x597D;&#x4E0D;&#x5BB9;&#x6613;&#x4E2A;&#x4EBA;&#x535A;&#x5BA2;&#x642D;&#x5EFA;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x4E86;&#x5F53;&#x521D;&#x60F3;&#x8981;&#x5199;&#x6587;&#x7684;&#x70ED;&#x5207;&#x4E86;&#x3002;</p>
<p>&#x672C;&#x4E3A;&#x4E86;&#x4F53;&#x9A8C;&#x66F4;&#x5E7D;&#x6DF1;&#x7684;&#x98CE;&#x666F;&#x9009;&#x62E9;&#x4E86;&#x5C0F;&#x5F84;&#xFF0C;&#x5374;&#x4E0D;&#x60F3;&#x88AB;&#x8DEF;&#x4E0A;&#x7684;&#x8346;&#x68D8;&#x5212;&#x5F97;&#x904D;&#x4F53;&#x9CDE;&#x4F24;&#xFF0C;&#x6700;&#x521D;&#x7684;&#x60F3;&#x8981;&#x5230;&#x8FBE;&#x76EE;&#x7684;&#x5730;&#x7684;&#x70ED;&#x5FF1;&#x5FC3;&#x60C5;&#xFF0C;&#x4E5F;&#x5F00;&#x59CB;&#x6162;&#x6162;&#x53D8;&#x6DE1;&#x3002;</p>
<blockquote class="blockquote-center"><p>&#x4E16;&#x754C;&#x90A3;&#x4E48;&#x5927;&#xFF0C;&#x6211;&#x60F3;&#x53BB;&#x770B;&#x770B; </p>
</blockquote>
<p>&#x4E16;&#x754C;&#x592A;&#x5927;&#x4E86;&#xFF0C;&#x603B;&#x60F3;&#x53BB;&#x770B;&#x770B;&#xFF0C;&#x5374;&#x5728;&#x6CA1;&#x770B;&#x8FC7;&#x7684;&#x98CE;&#x666F;&#x4E2D;&#x8FF7;&#x5931;&#x81EA;&#x5DF1;&#x7684;&#x672C;&#x6765;&#x8981;&#x5230;&#x8FBE;&#x7684;&#x76EE;&#x7684;&#x5730;&#x3002;</p>
<p>&#x4E0D;&#x77E5;&#x4E3A;&#x4F55;&#xFF0C;&#x6211;&#x7A81;&#x7136;&#x60F3;&#x8D77;&#x4E86;&#x300A;&#x897F;&#x6E38;&#x8BB0;&#x300B;&#x91CC;&#x7684;&#x5510;&#x50E7;&#x548C;&#x609F;&#x7A7A;&#x3002;&#x5510;&#x50E7;&#x8981;&#x53BB;&#x897F;&#x5929;&#x53D6;&#x7ECF;&#x5FC5;&#x987B;&#x811A;&#x8E0F;&#x5B9E;&#x5730;&#xFF0C;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x5730;&#x8D70;&#x8FC7;&#x53BB;&#xFF0C;&#x4ED6;&#x4E0D;&#x77E5;&#x9053;&#x897F;&#x5929;&#x5177;&#x4F53;&#x5728;&#x5728;&#x54EA;&#xFF0C;&#x4F46;&#x4ED6;&#x77E5;&#x9053;&#x4E0B;&#x4E00;&#x6B65;&#x5728;&#x54EA;&#x3002;&#x800C;&#x609F;&#x7A7A;&#x5219;&#x4E0D;&#x540C;&#xFF0C;&#x5BF9;&#x4E8E;&#x5510;&#x50E7;&#x800C;&#x8A00;&#x8FDC;&#x5728;&#x5929;&#x8FB9;&#x7684;&#x897F;&#x5929;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x8DDF;&#x6597;&#x7684;&#x529F;&#x592B;&#x5C31;&#x53EF;&#x4EE5;&#x5230;&#x4E86;&#x3002;&#x897F;&#x5929;&#x5728;&#x609F;&#x7A7A;&#x7684;&#x773C;&#x91CC;&#x5C31;&#x662F;&#x5982;&#x6765;&#x8001;&#x513F;&#x4F4F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E32;&#x95E8;&#x5982;&#x540C;&#x5BB6;&#x5E38;&#x4FBF;&#x996D;&#xFF0C;&#x54EA;&#x9700;&#x8981;&#x82B1;&#x4E2A;&#x5341;&#x5E74;&#x516B;&#x8F7D;&#x7684;&#x65F6;&#x95F4;&#x4E00;&#x8DEF;&#x8D70;&#x8FC7;&#x53BB;&#x3002;&#x800C;&#x609F;&#x7A7A;&#x65F6;&#x65F6;&#x90FD;&#x53EF;&#x4EE5;&#x7FFB;&#x4E2A;&#x7B4B;&#x6597;&#x5230;&#x897F;&#x5929;&#xFF0C;&#x5374;&#x4E0D;&#x5F97;&#x4E0D;&#x811A;&#x8E0F;&#x5B9E;&#x5730;&#x5730;&#x966A;&#x5510;&#x50E7;&#x8D70;&#x5C3D;&#x8FD9;&#x5C71;&#x6C34;&#x6D1E;&#x5929;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x609F;&#x7A7A;&#x7684;&#x4FEE;&#x884C;&#x2014;&#x2014;&#x5FCD;&#x8010;&#x3002;</p>
<p>&#x8FEB;&#x4F7F;&#x609F;&#x7A7A;&#x8E0F;&#x4E0A;&#x4FEE;&#x884C;&#x4E4B;&#x8DEF;&#x7684;&#x65E0;&#x7591;&#x662F;&#x7D27;&#x7B8D;&#x5492;&#xFF0C;&#x4F46;&#x4E8E;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x5374;&#x662F;&#x811A;&#x8E0F;&#x5B9E;&#x5730;&#x8D70;&#x4E00;&#x7A0B;&#x7684;&#x9B54;&#x5492;&#x3002;&#x6211;&#x50CF;&#x609F;&#x7A7A;&#x4E00;&#x6837;&#xFF0C;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x77E5;&#x9053;&#x4E86;&#x897F;&#x5929;&#x7684;&#x5B9E;&#x9645;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E5F;&#x77E5;&#x9053;&#x4E00;&#x6B65;&#x5373;&#x8FBE;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5374;&#x7FA1;&#x6155;&#x5510;&#x50E7;&#x4E00;&#x8DEF;&#x8D70;&#x8FC7;&#x53BB;&#x7684;&#x5145;&#x5B9E;&#x800C;&#x6253;&#x7B97;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x8D70;&#x8FC7;&#x53BB;&#x3002;&#x7136;&#x800C;&#x8FD9;&#x79CD;&#x534A;&#x540A;&#x5B50;&#x7684;&#x9B54;&#x5492;&#x6BD5;&#x7ADF;&#x4E0D;&#x6BD4;&#x7D27;&#x7B8D;&#x5492;&#x7684;&#x6765;&#x573A;&#x5927;&#xFF0C;&#x7981;&#x4E0D;&#x8D77;&#x6323;&#x624E;&#xFF0C;&#x6700;&#x7EC8;&#x6CA1;&#x4FEE;&#x5F97;&#x5FCD;&#x8010;&#xFF0C;&#x4E5F;&#x6CA1;&#x5230;&#x8FBE;&#x897F;&#x5929;&#x3002;</p>
<p>&#x5982;&#x679C;&#x90A3;&#x4E48;&#x60F3;&#x770B;&#x6CBF;&#x9014;&#x7684;&#x98CE;&#x666F;&#xFF0C;&#x90A3;&#x5C31;&#x522B;&#x8001;&#x60F3;&#x7740;&#x897F;&#x5929;&#x4E86;&#x3002;</p>
<p><img src="/2016/08/08/root/img01.jpg" alt=""></p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/碎语/" rel="tag">#碎语</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/08/09/install-python/" rel="prev" title="安装与配置 python2.x 和 python3.x">
                安装与配置 python2.x 和 python3.x <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.png"
               alt="方觉浅" />
          <p class="site-author-name" itemprop="name">方觉浅</p>
          <p class="site-description motion-element" itemprop="description">一方净室，磨半生蹉跎</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">3</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              
                <span class="site-state-item-count">4</span>
                <span class="site-state-item-name">标签</span>
              
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">方觉浅</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  




  
  

  

  

  

</body>
</html>
